# PANDAS :

PANDAS:python data analysis library

>it is used for data visualazation

# video 1:

# How to Made Data Frame With Dictionaries and Libraries

Dictionaries

In [2]:
import pandas as pd

In [3]:
d ={'name':['kishore','bibishan','laxaman'],'age':[12,55,78]}

In [4]:
df = pd.DataFrame(data =d)

In [5]:
df.head()

       name  age
0   kishore   12
1  bibishan   55
2   laxaman   78

List:

In [6]:
l = [['kishore','kumar','ravi'],[12,3,4]]

In [7]:
df = pd.DataFrame(data=l)

In [8]:
df.head()

         0      1     2
0  kishore  kumar  ravi
1       12      3     4

In [11]:
df = pd.DataFrame(data=l,columns=['name','age','love'])

In [13]:
df.head().T

            0   1
name  kishore  12
age     kumar   3
love     ravi   4